let media = './media/menus/Menuvid3.mp4'
let handler = async (m, { conn, command }) => {
let fkontak = { "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, "message": { "contactMessage": { "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` }}, "participant": "0@s.whatsapp.net" }
let str = `*╔════════❖•ೋ° °ೋ•❖════════╗*\n𝘽𝙄𝙀𝙉𝙑𝙀𝙉𝙄𝘿𝙊(𝘼) 𝘼 𝙇𝙊𝙎 𝙂𝙍𝙐𝙋𝙊𝙎 𝙊𝙁𝙄𝘾𝙄𝘼𝙇𝙀𝙎\n*╚════════❖•ೋ° °ೋ•❖════════╝*

≪━─━─━─━─◈─━─━─━─━≫
𝙏𝙚 𝙞𝙣𝙫𝙞𝙩𝙤 𝙖 𝙦𝙪𝙚 𝙩𝙚 𝙪𝙣𝙖𝙨 𝙖 𝙡𝙖 𝘾𝙤𝙢𝙪𝙣𝙞𝙙𝙖𝙙 𝐹𝑎𝑛𝑡𝑎𝑠𝑦𝐵𝑜𝑡-𝑀𝐷. ✨ 𝙏𝙚𝙣 𝙪𝙣 𝙗𝙪𝙚𝙣 𝙢𝙤𝙢𝙚𝙣𝙩𝙤 𝙚 𝙞𝙣𝙩𝙚𝙧𝙖𝙘𝙘𝙞𝙤𝙣𝙖 𝙘𝙤𝙣 𝙉𝙤𝙨𝙤𝙩𝙧𝙤𝙨.
╭━──━─━───≪✠≫─━─━─━━─━╮
𓃠 *Versión de ${gt}*
➥ ${vs}
◢◤◇◥◣◥◤◢◤◆◥◣◥◤◢◤◇◥◣
✅ 𝙂𝙍𝙐𝙋𝙊 𝙊𝙁𝙄𝘾𝙄𝘼𝙇 ${gt}
◢◤◇◥◣◥◤◢◤◆◥◣◥◤◢◤◇◥◣
✨ *Informate de las Novedades!!!*
🌺 *${nna}*\n
≪━─━─━─━─◈─━─━─━─━≫
🌺 *${nna2}*\n
≪━─━─━─━─◈─━─━─━─━≫
🌺*${nn}*\n
≪━─━─━─━─◈─━─━─━─━≫
🌺 *${nnn}*\n
≪━─━─━─━─◈─━─━─━─━≫
🌺 *${nnnt}*\n
≪━─━─━─━─◈─━─━─━─━≫
🌺 *${nnnttt3}*\n
≪━─━─━─━─◈─━─━─━─━≫
🌺 *${nnnttt4}*\n
≪━─━─━─━─◈─━─━─━─━≫ 
🌺 *${nnnttt5}*\n
╰━─━─━━─━─≪✠≫─━─━─━━─━╯
*Por favor, no ingresar con números de Bots, y mantener el respeto.*`
await conn.sendFile(m.chat, media, 'gata.mp4', str, fkontak)}
/*conn.sendHydrated(m.chat, str, `𝙂𝘼𝙏𝘼 𝘿𝙄𝙊𝙎 - 𝘼𝙎𝙄𝙎𝙏𝙀𝙉𝘾𝙄𝘼\n${asistencia}\n\n` + wm, media, 'https://github.com/GataNina-Li/GataBot-MD', '𝙂𝙖𝙩𝙖𝘽𝙤𝙩-𝙈𝘿', null, null, [
['𝘾𝙪𝙚𝙣𝙩𝙖𝙨 𝙊𝙛𝙞𝙘𝙞𝙖𝙡𝙚𝙨 | 𝘼𝙘𝙘𝙤𝙪𝙣𝙩𝙨 ✅', '.cuentasgb'],
['🎁 𝘿𝙤𝙣𝙖𝙧 | 𝘿𝙤𝙣𝙖𝙩𝙚', '.donar'],
['𝙑𝙤𝙡𝙫𝙚𝙧 𝙖𝙡 𝙈𝙚𝙣𝙪́ | 𝘽𝙖𝙘𝙠 𝙩𝙤 𝙈𝙚𝙣𝙪 ☘️', '/menu']
], m,)}*/

handler.command = /^linkgc|grupos|gruposgatabot|gatabotgrupos|gruposdegatabot|groupofc|gruposgb|grupogb|groupgb$/i
handler.exp = 33

export default handler
